In [20]:
import sqlite3
import pandas as pd

conexion = sqlite3.connect("proveedores.db")
cursor = conexion.cursor()

In [21]:
# Tabla proveedor
cursor.execute('''
    CREATE TABLE IF NOT EXISTS Proveedor (
        id_proveedor INTEGER PRIMARY KEY AUTOINCREMENT,
        nombre TEXT NOT NULL,
        direccion TEXT,
        ciudad TEXT,
        provincia TEXT,
        cp TEXT,
        telefono TEXT)
''')

In [22]:
# Tabla categoría
cursor.execute('''
    CREATE TABLE IF NOT EXISTS Categoria (
        id_categoria INTEGER PRIMARY KEY AUTOINCREMENT,
        nombre TEXT NOT NULL)
''')

In [23]:
#Tabla pieza
cursor.execute('''
    CREATE TABLE IF NOT EXISTS Pieza (
        id_pieza INTEGER PRIMARY KEY AUTOINCREMENT,
        nombre TEXT NOT NULL,
        marca TEXT,
        modelo_compatible TEXT,
        color TEXT,
        precio FLOAT,
        id_categoria INTEGER,
        FOREIGN KEY (id_categoria) REFERENCES Categoria(id_categoria))
''')

In [24]:
# Tabla almacen
cursor.execute('''
    CREATE TABLE IF NOT EXISTS Stock (
        id_stock INTEGER PRIMARY KEY AUTOINCREMENT,
        id_proveedor INTEGER,
        id_pieza INTEGER,
        fecha DATE NOT NULL,
        cantidad INTEGER NOT NULL,
        ubicacion TEXT,
        FOREIGN KEY (id_proveedor) REFERENCES Proveedor(id_proveedor),
        FOREIGN KEY (id_pieza) REFERENCES Pieza(id_pieza))
''')

In [25]:
# Introducimos los datos de las categorías
categorias = [
    ("Pantalla",),
    ("Bateria",),
    ("Camara",),
    ("Placabase",),
    ("Carcasa",),
    ("Altavoz",),
    ("Sensor",)
]
cursor.executemany("INSERT OR IGNORE INTO Categoria (nombre) VALUES (?)", categorias)

OperationalError: database is locked

In [ ]:
# Introducimos los datos de los proveedores
proveedores = [
    ("Repuestos Mobile S.L.", "Calle Circuito 21", "Madrid", "Madrid", "28001", "912345678"),
    ("iFixMovil", "Avenida Reparación 101", "Barcelona", "Barcelona", "08001", "933456789"),
    ("ElectroRepuestos", "Calle Batería 5", "Valencia", "Valencia", "46001", "961234567"),
    ("Piezas PhoneTech", "Polígono Smart 8", "Sevilla", "Sevilla", "41001", "954321654"),
    ("Tecnorrecambios", "Ronda Electrónica 44", "Bilbao", "Vizcaya", "48001", "944567890"),
    ("Recambios GSM", "Avenida Pantalla 17", "Zaragoza", "Zaragoza", "50001", "976543210"),
    ("Mundo Móvil", "Calle Antena 30", "Granada", "Andalucía", "18001", "958123456")
]
cursor.executemany('''INSERT INTO Proveedor (nombre, direccion, ciudad, provincia, cp, telefono)
    VALUES (?, ?, ?, ?, ?, ?)''', proveedores)

In [ ]:
# Introducimos las piezas de las que actualmente disponemos
piezas = [
    ("Pantalla OLED", "Apple", "iPhone 13", "Negro", 189.99, 1),
    ("Batería Li-Ion", "Samsung", "Galaxy S21", "N/A", 49.90, 2),
    ("Cámara trasera 12MP", "Xiaomi", "Redmi Note 11", "Negro", 29.99, 3),
    ("Placa base 128GB", "Apple", "iPhone 12", "N/A", 289.00, 4),
    ("Carcasa trasera", "Samsung", "Galaxy A52", "Azul", 19.95, 5),
    ("Altavoz interno", "Huawei", "P30", "Negro", 9.95, 6),
    ("Sensor de proximidad", "Realme", "Realme 8", "N/A", 4.75, 7)
]
cursor.executemany('''
    INSERT INTO Pieza (nombre, marca, modelo_compatible, color, precio, id_categoria)
    VALUES (?, ?, ?, ?, ?, ?)''', piezas)

In [ ]:
cursor.execute('''
    INSERT INTO Stock (id_proveedor, id_pieza, fecha, cantidad, ubicacion)
    VALUES (?, ?, ?, ?, ?)''', (1, 1, "2025-04-01", 8, "B2"))  

cursor.execute('''
    INSERT INTO Stock (id_proveedor, id_pieza, fecha, cantidad, ubicacion)
    VALUES (?, ?, ?, ?, ?)''', (2, 2, "2025-04-01", 12, "A1")) 

cursor.execute('''
    INSERT INTO Stock (id_proveedor, id_pieza, fecha, cantidad, ubicacion)
    VALUES (?, ?, ?, ?, ?)''', (3, 3, "2025-04-01", 20, "C3")) 

cursor.execute('''
    INSERT INTO Stock (id_proveedor, id_pieza, fecha, cantidad, ubicacion)
    VALUES (?, ?, ?, ?, ?)''', (4, 4, "2025-04-01", 4, "B3")) 

cursor.execute('''
    INSERT INTO Stock (id_proveedor, id_pieza, fecha, cantidad, ubicacion)
    VALUES (?, ?, ?, ?, ?)''', (5, 5, "2025-04-01", 10, "A2")) 

cursor.execute('''
    INSERT INTO Stock (id_proveedor, id_pieza, fecha, cantidad, ubicacion)
    VALUES (?, ?, ?, ?, ?)''', (6, 6, "2025-04-01", 18, "D4")) 

cursor.execute('''
    INSERT INTO Stock (id_proveedor, id_pieza, fecha, cantidad, ubicacion)
    VALUES (?, ?, ?, ?, ?)''', (7, 7, "2025-04-01", 30, "E5"))

In [16]:
def sql_query(query):
    cursor.execute(query)
    Lista = cursor.fetchall()
    names = [description[0] for description in cursor.description]
    return pd.DataFrame(Lista, columns=names)

In [17]:
query='''Select * From proveedor'''
sql_query(query)

Empty DataFrame
Columns: [id_proveedor, nombre, direccion, ciudad, provincia]
Index: []

In [ ]:
query='''Select * From categoria'''
sql_query(query)

   id_categoria     nombre
0             1   Pantalla
1             2    Bateria
2             3     Camara
3             4  Placabase
4             5    Carcasa
5             6    Altavoz
6             7     Sensor

In [ ]:
query='''Select * From pieza'''
sql_query(query)

,id_pieza,nombre,marca,modelo_compatible,color,precio,id_categoria
0,1,Pantalla OLED,Apple,iPhone 13,Negro,189.99,1
1,2,Batería Li-Ion,Samsung,Galaxy S21,N/A,49.90,2
2,3,Cámara trasera 12MP,Xiaomi,Redmi Note 11,Negro,29.99,3
3,4,Placa base 128GB,Apple,iPhone 12,N/A,289.00,4
4,5,Carcasa trasera,Samsung,Galaxy A52,Azul,19.95,5
5,6,Altavoz interno,Huawei,P30,Negro,9.95,6
6,7,Sensor de proximidad,Realme,Realme 8,N/A,4.75,7

In [ ]:
query='''Select * From stock'''
sql_query(query)

   id_stock  id_proveedor  id_pieza       fecha  cantidad ubicacion
0         1             1         1  2025-04-01         8        B2
1         2             2         2  2025-04-01        12        A1
2         3             3         3  2025-04-01        20        C3
3         4             4         4  2025-04-01         4        B3
4         5             5         5  2025-04-01        10        A2
5         6             6         6  2025-04-01        18        D4
6         7             7         7  2025-04-01        30        E5

In [9]:
# Pedido de placas base

query= '''
    INSERT INTO Stock (id_proveedor, id_pieza, fecha, cantidad, ubicacion)
    VALUES (?, ?, ?, ?, ?)''', (4, 4, "2025-04-08", 2, "B3")
sql_query(query)

NameError: name 'sql_query' is not defined

In [19]:
conexion.commit()
conexion.close()